assignment-11.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Assignment 12, Linear Algebra 1</title>
<!-- 2014-11-02 Sun 23:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Oleg Sivokon" />
<meta  name="description" content="First asssignment in the course Linear Algebra 1"
 />
<meta  name="keywords" content="Assignment, Linear Algebra" />
<link rel="stylesheet" type="text/css" href="./css/style.css"/>
<link rel="stylesheet" type="text/css" href="./css/bootstrap.min.css"/>
<link rel="stylesheet" type="text/css" href="./css/icfp.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Assignment 12, Linear Algebra 1</h1>
