assignment-11.org
*** Answer 1

    First, express $x$, $y$ and $z$ through $a$:
    
    #+NAME: prob1
    #+HEADER: :exports both
    #+BEGIN_SRC maxima :results output
      programmode: false;
      linsystem: [  x + 2*y       + a*z = -3 - a,
                    x + (2 - a)*y -   z = 1  - a,
                  a*x + a*y             = 6];
      print(linsolve(linsystem, [x, y, z]));
    #+END_SRC

    #+RESULTS: prob1
    #+begin_example
    Solution:
                                     3      2
                                    a  - 6 a  + 15 a + 12
                              x = - ---------------------
                                          3    2
                                         a  - a  - a
                                         2
                                        a  + 3 a + 2
                                  z = - ------------
                                          2
                                         a  - a - 1
                                        3
                                       a  + 9 a + 6
                                   y = ------------
                                        3    2
                                       a  - a  - a
    [%t1, %t2, %t3] 
#+end_example

    It's easy to see now that by solving $a^3-a^2+a=0$ we can find such an
    assignment to $a$, which produces no solutions for the system.

    #+NAME: prob2
    #+HEADER: :exports both
    #+BEGIN_SRC maxima :results output
      programmode: false;
      print(solve([a^3 - a^2 - a = 0], a));
      print(solve([a^2 - a = 1], a));
    #+END_SRC

    #+RESULTS: prob2
    #+begin_example
    solve: solution:
                                         sqrt(5) - 1
                                   a = - -----------
                                              2
                                        sqrt(5) + 1
                                    a = -----------
                                             2
                                         a = 0
    [%t1, %t2, %t3] 
    solve: solution:
                                         sqrt(5) - 1
                                   a = - -----------
                                              2
                                        sqrt(5) + 1
                                    a = -----------
                                             2
    [%t4, %t5] 
#+end_example

    Ignoring the complex solutions, we are left with $a=0$ assignement.  Let's
    verify it:

    #+NAME: prob3
    #+HEADER: :exports both
    #+BEGIN_SRC maxima :results output
      programmode: false;
      a: 0;
      linsystem: [  x + 2*y       - a*z = -3 - a,
                    x + (2 - a)*y -   z = 1  - a,
                  a*x + a*y             = 6];
      print(linsolve(linsystem, [x, y, z]));
    #+END_SRC

    #+RESULTS: prob3
    : []

    Indeed, produces no solutions.

    To find out whether there might be infinite solutions, let's first find
    the reduced echelon form of the system:

    #+NAME: prob4
    #+HEADER: :exports both
    #+BEGIN_SRC maxima :results output
      programmode: false;
      linsystem: [  x + 2*y       - a*z = -3 - a,
                    x + (2 - a)*y -   z = 1  - a,
                  a*x + a*y             = 6];
      print(triangularize(coefmatrix(linsystem, [x, y, z])));
    #+END_SRC

    #+RESULTS: prob4
    : [ 1   2       - a     ]
    : [                     ]
    : [              2      ]
    : [ 0  - a      a       ] 
    : [                     ]
    : [          3    2     ]
    : [ 0   0   a  - a  + a ]

    By examining the reduced echelon form, we can see that infinitely many
    solutions are only possible if $a$ was equal to 0, but we know that at 0
    system has no solutions.  Thus any assignment to $a$ will produce a unique
    solution.

