assignment-11.org
*** Answer 2

    First, express $a$ and $b$ through $x$, $y$ and $z$:
    
    #+NAME: prob5
    #+HEADER: :exports both
    #+BEGIN_SRC maxima :results output
      programmode: false;
      linsystem: [  x + a*y         + b*z         + a*w         = b,
                    x + (a + 1)*y   + (a + b)*z   + (a + b)*w   = a   + b,
                  a*x + a^2*y       + (a*b + 1)*z + (a + a^2)*w = b   + a*b,
                  2*x + (2*a + 1)*y + (a + 2*b)*z  + a*w        = 2*b - 2*a - a*b];
      print(linsolve(linsystem, [x, y, z, w]));
    #+END_SRC

    #+RESULTS: prob5
    #+begin_example
    Solution:
             3         2           2     4    3      2             4    3      2
            b  + (- 3 a  + a - 1) b  + (a  - a  - 4 a  - a) b + 3 a  + a  + 3 a
      x = - --------------------------------------------------------------------
                                           b + a
                                   2         2         2
                                  b  + (a - a ) b - 3 a
                              z = ----------------------
                                          b + a
                               2       3    2               3    2
                          2 a b  + (- a  + a  + 2 a) b - 3 a  - a
                    y = - ----------------------------------------
                                           b + a
                                         a b + 3 a
                                     w = ---------
                                           b + a
    [%t1, %t2, %t3, %t4] 
    #+end_example

    One can see that assignment $a = -b$ will result in solutions (any such combination
    will be equivalent to divsion by zero).

    Since reduced echelon form of this system is:

    #+NAME: prob6
    #+HEADER: :exports both
    #+BEGIN_SRC maxima :results output
      programmode: false;
      linsystem: [  x + a*y         + b*z         + a*w         = b,
                    x + (a + 1)*y   + (a + b)*z   + (a + b)*w   = a   + b,
                  a*x + a^2*y       + (a*b + 1)*z + (a + a^2)*w = b   + a*b,
                  2*x + (2*a + 1)*y + (a + 2*b)*z + a*w         = 2*b - 2*a - a*b];
      print(triangularize(coefmatrix(linsystem, [x, y, z, w])));
    #+END_SRC

    #+RESULTS: prob6
    : [ 1  a  b     a    ]
    : [                  ]
    : [ 0  1  a     b    ]
    : [                  ] 
    : [ 0  0  1     a    ]
    : [                  ]
    : [ 0  0  0  - b - a ]

    In order to find an assignment, which would eliminate one pivot from reduced
    echelon form, we would need to solve $-b - a = 0$, but this is exactly the
    assignment which gives single solution.  So, as before, there appear to be
    no assignment that produces infinitely many solutions.

