assignment-11.html
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Problem 3</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>Solve the system of linear equations:

\begin{equation*}
  \left.
    \begin{alignedat}{5}
      &  \frac{1}{x} & {}+{} & \frac{2}{y} & {}-{} & \frac{4}{z}  & {}={} & 1 \\
      &  \frac{2}{x} & {}+{} & \frac{3}{y} & {}+{} & \frac{8}{z}  & {}={} & 0 \\
      &  \frac{1}{x} & {}+{} & \frac{9}{y} & {}-{} & \frac{10}{z} & {}={} & 5
    \end{alignedat}
  \quad \right\} \qquad
  \begin{aligned}
    x, y, z \in \mathbb{R}
  \end{aligned}
\end{equation*}
</li>
</ol>
</div>

<div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Answer 3</h4>
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">

<pre class="src src-maxima" id="prob7"><span style="color: #f0ffff; background-color: #0d1719;">programmode:</span> <span style="color: #dd9aa7; background-color: #0a1519;">false</span>;
linsystem<span style="color: #f0ffff; background-color: #0d1719;">:</span> [ <span style="color: #dd9aa7; background-color: #0a1519;">1</span><span style="color: #f0ffff; background-color: #0d1719;">/</span>x <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">/</span>y <span style="color: #f0ffff; background-color: #0d1719;">-</span>  <span style="color: #dd9aa7; background-color: #0a1519;">4</span><span style="color: #f0ffff; background-color: #0d1719;">/</span>z <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">1</span>,
             <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">/</span>x <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">/</span>y <span style="color: #f0ffff; background-color: #0d1719;">+</span>  <span style="color: #dd9aa7; background-color: #0a1519;">8</span><span style="color: #f0ffff; background-color: #0d1719;">/</span>z <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">0</span>,
             <span style="color: #dd9aa7; background-color: #0a1519;">1</span><span style="color: #f0ffff; background-color: #0d1719;">/</span>x <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">9</span><span style="color: #f0ffff; background-color: #0d1719;">/</span>y <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">10</span><span style="color: #f0ffff; background-color: #0d1719;">/</span>z <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">5</span>];
<span style="color: #75dbb7; background-color: #0a1519;">linsolve</span>(linsystem, [x, y, z]);
</pre>
</div>

<pre class="example">
Solution:
                                     x = 0
                                     y = 0
                                     z = 0
</pre>

<p>
The reduced echelon form of the matrix of this system has a pivot element in
every column, which means that this system can have at most one solution.
Unfortunately, this solution encounters division by zero, which renders this
system as having no solutions.
</p>

<div class="org-src-container">

<pre class="src src-maxima" id="prob8"><span style="color: #f0ffff; background-color: #0d1719;">programmode:</span> <span style="color: #dd9aa7; background-color: #0a1519;">false</span>;
solution<span style="color: #f0ffff; background-color: #0d1719;">:</span> <span style="color: #75dbb7; background-color: #0a1519;">triangularize</span>(<span style="color: #75dbb7; background-color: #0a1519;">coefmatrix</span>(
[ <span style="color: #f0ffff; background-color: #0d1719;">-</span>x<span style="color: #f0ffff; background-color: #0d1719;">*</span>y<span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x<span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">4</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x<span style="color: #f0ffff; background-color: #0d1719;">*</span>y <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">0</span>,
  <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>y<span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x<span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">8</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x<span style="color: #f0ffff; background-color: #0d1719;">*</span>y <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">0</span>,
  y<span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">9</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x<span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">10</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x<span style="color: #f0ffff; background-color: #0d1719;">*</span>y <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">5</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x<span style="color: #f0ffff; background-color: #0d1719;">*</span>y<span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">0</span>],
  [x, y, z]));
<span style="color: #75dbb7; background-color: #0a1519;">print</span>(solution);
</pre>
</div>

<p>
The system above would be equivalent to the given system under assumption that
\(x \neq 0\), \(y \neq 0\) and \(z \neq 0\).
</p>

<pre class="example">
        [ 3 z + 8 y ]         [              2 z + 8 x              ]
        [           ]         [                                     ]
Col 1 = [     0     ] Col 2 = [                  2                  ]
        [           ]         [ (2 y - 3 x - 4) z  + (8 y - 28 x) z ]
        [     0     ]         [                                     ]
                              [                  0                  ]
                               [                 2 y + 3 x                  ]
                               [                                            ]
                               [       2                       2            ]
                       Col 3 = [   (2 y  - 4 y) z + (8 - 8 x) y  + 28 x y   ] 
                               [                                            ]
                               [       2                    2             2 ]
                               [ ((98 x  + 168 x) y - 52 x y ) z - 5 x y z  ]
</pre>
</div>
</div>
</div>
