assignment-11.tex
\subsection{Problem 3}
\label{sec-1-3}

\begin{enumerate}
\item Solve the system of linear equations:

\begin{equation*}
  \left.
    \begin{alignedat}{5}
      &  \frac{1}{x} & {}+{} & \frac{2}{y} & {}-{} & \frac{4}{z}  & {}={} & 1 \\
      &  \frac{2}{x} & {}+{} & \frac{3}{y} & {}+{} & \frac{8}{z}  & {}={} & 0 \\
      &  \frac{1}{x} & {}+{} & \frac{9}{y} & {}-{} & \frac{10}{z} & {}={} & 5
    \end{alignedat}
  \quad \right\} \qquad
  \begin{aligned}
    x, y, z \in \mathbb{R}
  \end{aligned}
\end{equation*}
\end{enumerate}

\subsubsection{Answer 3}
\label{sec-1-3-1}

\begin{maxima}
programmode: false;
linsystem: [ 1/x + 2/y -  4/z = 1,
             2/x + 3/y +  8/z = 0,
             1/x + 9/y + 10/z = 5];
linsolve(linsystem, [x, y, z]);
\end{maxima}

\begin{verbatim}
Solution:
                                     x = 0
                                     y = 0
                                     z = 0
\end{verbatim}

The reduced echelon form of the matrix of this system has a pivot element in
every column, which means that this system can have at most one solution.
Unfortunately, this solution encounters division by zero, which renders this
system as having no solutions.

\begin{maxima}
programmode: false;
solution: triangularize(coefmatrix(
[ -x*y*z + 2*x*z - 4*x*y = 0,
  2*y*z + 3*x*z + 8*x*y = 0,
  y*z + 9*x*z + 10*x*y - 5*x*y*z = 0],
  [x, y, z]));
print(solution);
\end{maxima}

The system above would be equivalent to the given system under assumption that
$x \neq 0$, $y \neq 0$ and $z \neq 0$.

\begin{verbatim}
        [ 3 z + 8 y ]         [              2 z + 8 x              ]
        [           ]         [                                     ]
Col 1 = [     0     ] Col 2 = [                  2                  ]
        [           ]         [ (2 y - 3 x - 4) z  + (8 y - 28 x) z ]
        [     0     ]         [                                     ]
                              [                  0                  ]
                               [                 2 y + 3 x                  ]
                               [                                            ]
                               [       2                       2            ]
                       Col 3 = [   (2 y  - 4 y) z + (8 - 8 x) y  + 28 x y   ] 
                               [                                            ]
                               [       2                    2             2 ]
                               [ ((98 x  + 168 x) y - 52 x y ) z - 5 x y z  ]
\end{verbatim}
