assignment-11.html
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Problem 4</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Given \(U = \{\vec{u_1}, \vec{u_2}, \vec{u_3}, \vec{u_4}\}\) is a linearly
independant set of vectors in \(\mathbb{R}^5\) and vectors:
</p>

\begin{equation*}
  \begin{alignedat}{4}
    & v_1 & {}={} & 8au_1 {}+{} & 2u_2 {}+{}   & u_3 \\
    & v_2 & {}={} &             & 16au_2 {}+{}                        & u_4 \\
    & v_3 & {}={} & u_1 {}-{}                  & \frac{1}{2}u_3 {}+{} & au_4 \\
    & a \in \mathbb{R}
  \end{alignedat}
\end{equation*}

<ol class="org-ol">
<li>Find all \(a\) such that \(V = \{v_1, v_2, v_3\}\) is linearly dependent.
</li>
<li>For every \(a\) found in (1), write \(v_2\) as linear combination of \(v_1\)
and \(v_3\).
</li>
<li>Is it possible to adjoin the vectors \(v_i\) to \(U\) such that 
      \(U \cup \{v_i\}\) would become a basis in \(\mathbb{R}\)?
</li>
</ol>
</div>

<div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> Answer 4</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
First we will arrange all coefficients describing vectors \(v_i\) as rows of the
matrix:
</p>

<div class="org-src-container">

<pre class="src src-maxima" id="prob9"><span style="color: #f0ffff; background-color: #0d1719;">programmode:</span> <span style="color: #dd9aa7; background-color: #0a1519;">false</span>;
solution<span style="color: #f0ffff; background-color: #0d1719;">:</span> <span style="color: #75dbb7; background-color: #0a1519;">triangularize</span>(<span style="color: #75dbb7; background-color: #0a1519;">transpose</span>(<span style="color: #75dbb7; background-color: #0a1519;">matrix</span>(
    [<span style="color: #dd9aa7; background-color: #0a1519;">8</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a, <span style="color: #dd9aa7; background-color: #0a1519;">2</span>,    <span style="color: #dd9aa7; background-color: #0a1519;">1</span>,   <span style="color: #dd9aa7; background-color: #0a1519;">0</span>],
    [<span style="color: #dd9aa7; background-color: #0a1519;">0</span>,   <span style="color: #dd9aa7; background-color: #0a1519;">16</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a, <span style="color: #dd9aa7; background-color: #0a1519;">0</span>,   <span style="color: #dd9aa7; background-color: #0a1519;">1</span>],
    [<span style="color: #dd9aa7; background-color: #0a1519;">1</span>,   <span style="color: #dd9aa7; background-color: #0a1519;">0</span>,   <span style="color: #f0ffff; background-color: #0d1719;">-</span><span style="color: #dd9aa7; background-color: #0a1519;">1</span><span style="color: #f0ffff; background-color: #0d1719;">/</span><span style="color: #dd9aa7; background-color: #0a1519;">2</span>, a])));
<span style="color: #75dbb7; background-color: #0a1519;">print</span>(solution);
</pre>
</div>

<pre class="example">
[ 2   0       - 1    ]
[                    ]
[ 0  32 a      2     ]
[                    ] 
[              2     ]
[ 0   0    32 a  - 2 ]
[                    ]
[ 0   0        0     ]
</pre>

<p>
In order for this matrix to represent linearly dependent combination, it should
be the case that \(32^a - 2 = 0\).  Otherwise, this system has no solutions (but
it has to, becuase it is given that \(v_i\) is linearly dependant, which requires
that linear combinations of all dependent vectors be equal to zero vector).
</p>

<div class="org-src-container">

<pre class="src src-maxima" id="prob10">solution<span style="color: #f0ffff; background-color: #0d1719;">:</span> <span style="color: #75dbb7; background-color: #0a1519;">solve</span>([<span style="color: #dd9aa7; background-color: #0a1519;">32</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a<span style="color: #f0ffff; background-color: #0d1719;">^</span><span style="color: #dd9aa7; background-color: #0a1519;">2</span> <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span>], a);
<span style="color: #75dbb7; background-color: #0a1519;">tex</span>(solution);
</pre>
</div>

<p>
$$\left[ a=-{{1}\over{4}} , a={{1}\over{4}} \right] $$
</p>

<p>
Now we can write \(v_2\) as linear combination of \(v_1\) and \(v_3\) for \({{1}\over{4}}\):
</p>

\begin{equation*}
\begin{alignedat}{5}
 & (0, \frac{32}{4}, 0, 0) &{}={}& x(2, 0, 0, 0)  &{}+{}& y(-1, 2, \frac{32}{4^2} - 2) \\
 & (0, 8, 0, 0)            &{}={}& x(2, 0, 0, 0)  &{}+{}& y(-1, 2, 0, 0) \\
 & (0, 8, 0, 0)            &{}={}& 4(-1, 2, 0, 0) &{}+{}& 2(2, 0, 0, 0)\\
 & v_2                     &{}={}& 4v_3           &{}+{}& 2v_1
\end{alignedat}
\end{equation*}

<p>
and similarly for \(-{{1}\over{4}}\):
</p>

\begin{equation*}
\begin{alignedat}{5}
 & (0, -\frac{32}{4}, 0, 0) &{}={}& x(2, 0, 0, 0)   &{}+{}& y(-1, 2, \frac{32}{-4^2} - 2) \\
 & (0, -8, 0, 0)            &{}={}& x(2, 0, 0, 0)   &{}+{}& y(-1, 2, 0, 0) \\
 & (0, -8, 0, 0)            &{}={}& -4(-1, 2, 0, 0) &{}+{}& -2(2, 0, 0, 0)\\
 & v_2                      &{}={}& -4v_3           &{}+{}& -2v_1
\end{alignedat}
\end{equation*}
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Exercises</h2>
<div class="outline-text-2" id="text-2">
<p>
Given \(O\) is a homogeneous system of linear equations, and \(M\) is not
homogeneous system of linear equations, which share the coefficients of the
row vectors of their respective matrices sans the last one.  Both \(O\) and \(M\)
have \(m\) equations and \(n\) unknowns.
</p>

<ul class="org-ul">
<li><b>a</b> if only the first statement is correct.
</li>
<li><b>b</b> if only the second statement is correct.
</li>
<li><b>c</b> if both statements are correct.
</li>
<li><b>d</b> if neither statement is correct.
</li>
</ul>
</div>
