assignment-11.tex
\subsection{Problem 4}
\label{sec-1-4}
Given $U = \{\vec{u_1}, \vec{u_2}, \vec{u_3}, \vec{u_4}\}$ is a linearly
independant set of vectors in $\mathbb{R}^5$ and vectors:

\begin{equation*}
  \begin{alignedat}{4}
    & v_1 & {}={} & 8au_1 {}+{} & 2u_2 {}+{}   & u_3 \\
    & v_2 & {}={} &             & 16au_2 {}+{}                        & u_4 \\
    & v_3 & {}={} & u_1 {}-{}                  & \frac{1}{2}u_3 {}+{} & au_4 \\
    & a \in \mathbb{R}
  \end{alignedat}
\end{equation*}

\begin{enumerate}
\item Find all $a$ such that $V = \{v_1, v_2, v_3\}$ is linearly dependent.
\item For every $a$ found in (1), write $v_2$ as linear combination of $v_1$
and $v_3$.
\item Is it possible to adjoin the vectors $v_i$ to $U$ such that 
      $U \cup \{v_i\}$ would become a basis in $\mathbb{R}$?
\end{enumerate}

\subsubsection{Answer 4}
\label{sec-1-4-1}

First we will arrange all coefficients describing vectors $v_i$ as rows of the
matrix:

\begin{maxima}
programmode: false;
solution: triangularize(transpose(matrix(
    [8*a, 2,    1,   0],
    [0,   16*a, 0,   1],
    [1,   0,   -1/2, a])));
print(solution);
\end{maxima}

\begin{verbatim}
[ 2   0       - 1    ]
[                    ]
[ 0  32 a      2     ]
[                    ] 
[              2     ]
[ 0   0    32 a  - 2 ]
[                    ]
[ 0   0        0     ]
\end{verbatim}

In order for this matrix to represent linearly dependent combination, it should
be the case that $32^a - 2 = 0$.  Otherwise, this system has no solutions (but
it has to, becuase it is given that $v_i$ is linearly dependant, which requires
that linear combinations of all dependent vectors be equal to zero vector).

\begin{maxima}
solution: solve([32*a^2 - 2], a);
tex(solution);
\end{maxima}

$$\left[ a=-{{1}\over{4}} , a={{1}\over{4}} \right] $$

Now we can write $v_2$ as linear combination of $v_1$ and $v_3$ for ${{1}\over{4}}$:

\begin{equation*}
\begin{alignedat}{5}
 & (0, \frac{32}{4}, 0, 0) &{}={}& x(2, 0, 0, 0)  &{}+{}& y(-1, 2, \frac{32}{4^2} - 2) \\
 & (0, 8, 0, 0)            &{}={}& x(2, 0, 0, 0)  &{}+{}& y(-1, 2, 0, 0) \\
 & (0, 8, 0, 0)            &{}={}& 4(-1, 2, 0, 0) &{}+{}& 2(2, 0, 0, 0)\\
 & v_2                     &{}={}& 4v_3           &{}+{}& 2v_1
\end{alignedat}
\end{equation*}

and similarly for $-{{1}\over{4}}$:

\begin{equation*}
\begin{alignedat}{5}
 & (0, -\frac{32}{4}, 0, 0) &{}={}& x(2, 0, 0, 0)   &{}+{}& y(-1, 2, \frac{32}{-4^2} - 2) \\
 & (0, -8, 0, 0)            &{}={}& x(2, 0, 0, 0)   &{}+{}& y(-1, 2, 0, 0) \\
 & (0, -8, 0, 0)            &{}={}& -4(-1, 2, 0, 0) &{}+{}& -2(2, 0, 0, 0)\\
 & v_2                      &{}={}& -4v_3           &{}+{}& -2v_1
\end{alignedat}
\end{equation*}
\section{Exercises}
\label{sec-2}
Given $O$ is a homogeneous system of linear equations, and $M$ is not
homogeneous system of linear equations, which share the coefficients of the
row vectors of their respective matrices sans the last one.  Both $O$ and $M$
have $m$ equations and $n$ unknowns.

\begin{itemize}
\item \textbf{a} if only the first statement is correct.
\item \textbf{b} if only the second statement is correct.
\item \textbf{c} if both statements are correct.
\item \textbf{d} if neither statement is correct.
\end{itemize}
