assignment-11.org
** Exercise 1
   
   1. There are infinitely many solutions (to the system of linear equations
      given below).
   2. The homogeneous matrix created using the given system of linear equations
      has infinitely many solutions.

   #+NAME: sys1
   #+HEADER: :exports both
   #+BEGIN_SRC maxima :results output
     programmode: false;
     linsystem: [  a + 2*b -   c +   d = 2,
                 2*a + 3*b - 3*c + 2*d = 3,
                  -a -   b + 2*c -   d = -1,
                 2*a + 4*b - 2*c + 3*d = 3,
                 2*a + 2*b - 4*c + 2*d = 2];
     linsolve(linsystem, [a, b, c, d]);
   #+END_SRC

   #+RESULTS: sys1
   : solve: dependent equations eliminated: (2 5)
   : Solution:
   :                                  a = 4 - 3 %r1
   :                                     d = - 1
   :                                   c = 1 - %r1
   :                                     b = %r1

   /Answer:/ *c*

** Exercise 2
   1. The system given below has no solutions.
   2. The system given below taken without its first equantion has no solutions.
      
   #+NAME: sys2
   #+HEADER: :exports both
   #+BEGIN_SRC maxima :results output
     programmode: false;
     linsystem: [  a +   b +         d -   e = -1,
                               c +   d + 2*e = 2,
                 3*a + 3*b + 2*c + 5*d + 2*e = 2,
                 3*a + 3*b + 4*c + 7*d + 6*e = 2];
     linsolve(linsystem, [a, b, c, d, e]);
   #+END_SRC

   #+RESULTS: sys2

   #+NAME: sys3
   #+HEADER: :exports both
   #+BEGIN_SRC maxima :results output
     programmode: false;
     linsystem: [              c +   d + 2*e = 2,
                 3*a + 3*b + 2*c + 5*d + 2*e = 2,
                 3*a + 3*b + 4*c + 7*d + 6*e = 2];
     linsolve(linsystem, [a, b, c, d, e]);
   #+END_SRC

   #+RESULTS: sys3

   /Answer:/ *c*

