assignment-11.html

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Exercise 1</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>There are infinitely many solutions (to the system of linear equations
given below).
</li>
<li>The homogeneous matrix created using the given system of linear equations
has infinitely many solutions.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-maxima" id="sys1"><span style="color: #f0ffff; background-color: #0d1719;">programmode:</span> <span style="color: #dd9aa7; background-color: #0a1519;">false</span>;
linsystem<span style="color: #f0ffff; background-color: #0d1719;">:</span> [  a <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>b <span style="color: #f0ffff; background-color: #0d1719;">-</span>   c <span style="color: #f0ffff; background-color: #0d1719;">+</span>   d <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span>,
            <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>b <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>c <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>d <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span>,
             <span style="color: #f0ffff; background-color: #0d1719;">-</span>a <span style="color: #f0ffff; background-color: #0d1719;">-</span>   b <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>c <span style="color: #f0ffff; background-color: #0d1719;">-</span>   d <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #f0ffff; background-color: #0d1719;">-</span><span style="color: #dd9aa7; background-color: #0a1519;">1</span>,
            <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">4</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>b <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>c <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>d <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span>,
            <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>b <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">4</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>c <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>d <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span>];
<span style="color: #75dbb7; background-color: #0a1519;">linsolve</span>(linsystem, [a, b, c, d]);
</pre>
</div>

<pre class="example">
solve: dependent equations eliminated: (2 5)
Solution:
                                 a = 4 - 3 %r1
                                    d = - 1
                                  c = 1 - %r1
                                    b = %r1
</pre>

<p>
<i>Answer:</i> <b>c</b>
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Exercise 2</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>The system given below has no solutions.
</li>
<li>The system given below taken without its first equantion has no solutions.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-maxima" id="sys2"><span style="color: #f0ffff; background-color: #0d1719;">programmode:</span> <span style="color: #dd9aa7; background-color: #0a1519;">false</span>;
linsystem<span style="color: #f0ffff; background-color: #0d1719;">:</span> [  a <span style="color: #f0ffff; background-color: #0d1719;">+</span>   b <span style="color: #f0ffff; background-color: #0d1719;">+</span>         d <span style="color: #f0ffff; background-color: #0d1719;">-</span>   e <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #f0ffff; background-color: #0d1719;">-</span><span style="color: #dd9aa7; background-color: #0a1519;">1</span>,
                          c <span style="color: #f0ffff; background-color: #0d1719;">+</span>   d <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>e <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span>,
            <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>b <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>c <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">5</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>d <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>e <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span>,
            <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>b <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">4</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>c <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">7</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>d <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">6</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>e <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span>];
<span style="color: #75dbb7; background-color: #0a1519;">linsolve</span>(linsystem, [a, b, c, d, e]);
</pre>
</div>

<div class="org-src-container">

<pre class="src src-maxima" id="sys3"><span style="color: #f0ffff; background-color: #0d1719;">programmode:</span> <span style="color: #dd9aa7; background-color: #0a1519;">false</span>;
linsystem<span style="color: #f0ffff; background-color: #0d1719;">:</span> [              c <span style="color: #f0ffff; background-color: #0d1719;">+</span>   d <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>e <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span>,
            <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>b <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>c <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">5</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>d <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>e <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span>,
            <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>a <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>b <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">4</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>c <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">7</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>d <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">6</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>e <span style="color: #f0ffff; background-color: #0d1719;">=</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span>];
<span style="color: #75dbb7; background-color: #0a1519;">linsolve</span>(linsystem, [a, b, c, d, e]);
</pre>
</div>

<p>
<i>Answer:</i> <b>c</b>
</p>
</div>
</div>
