assignment-11.tex

\subsection{Exercise 1}
\label{sec-2-1}

\begin{enumerate}
\item There are infinitely many solutions (to the system of linear equations
given below).
\item The homogeneous matrix created using the given system of linear equations
has infinitely many solutions.
\end{enumerate}

\begin{maxima}
programmode: false;
linsystem: [  a + 2*b -   c +   d = 2,
            2*a + 3*b - 3*c + 2*d = 3,
             -a -   b + 2*c -   d = -1,
            2*a + 4*b - 2*c + 3*d = 3,
            2*a + 2*b - 4*c + 2*d = 2];
linsolve(linsystem, [a, b, c, d]);
\end{maxima}

\begin{verbatim}
solve: dependent equations eliminated: (2 5)
Solution:
                                 a = 4 - 3 %r1
                                    d = - 1
                                  c = 1 - %r1
                                    b = %r1
\end{verbatim}

\emph{Answer:} \textbf{c}
\subsection{Exercise 2}
\label{sec-2-2}
\begin{enumerate}
\item The system given below has no solutions.
\item The system given below taken without its first equantion has no solutions.
\end{enumerate}

\begin{maxima}
programmode: false;
linsystem: [  a +   b +         d -   e = -1,
                          c +   d + 2*e = 2,
            3*a + 3*b + 2*c + 5*d + 2*e = 2,
            3*a + 3*b + 4*c + 7*d + 6*e = 2];
linsolve(linsystem, [a, b, c, d, e]);
\end{maxima}

\begin{maxima}
programmode: false;
linsystem: [              c +   d + 2*e = 2,
            3*a + 3*b + 2*c + 5*d + 2*e = 2,
            3*a + 3*b + 4*c + 7*d + 6*e = 2];
linsolve(linsystem, [a, b, c, d, e]);
\end{maxima}

\emph{Answer:} \textbf{c}
