assignment-11.html
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Exercise 3</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-maxima" id="sys4"><span style="color: #f0ffff; background-color: #0d1719;">programmode:</span> <span style="color: #dd9aa7; background-color: #0a1519;">false</span>;
linsystem<span style="color: #f0ffff; background-color: #0d1719;">:</span> [  x <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>y <span style="color: #f0ffff; background-color: #0d1719;">-</span>  <span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">=</span> a,
            <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">6</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>y <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">11</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">=</span> b,
              x <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>y <span style="color: #f0ffff; background-color: #0d1719;">+</span>  <span style="color: #dd9aa7; background-color: #0a1519;">7</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">=</span> c];
<span style="color: #75dbb7; background-color: #0a1519;">linsolve</span>(linsystem, [a, b, c]);
</pre>
</div>

<pre class="example">
Solution:
                              a = - 3 z + 2 y + x
                            b = - 11 z + 6 y + 2 x
                               c = 7 z - 2 y + x
</pre>


<ol class="org-ol">
<li>There exist such \(a\), \(b\) and \(c\), which are the unique solution to
the system.
</li>
<li>There are such \(a\), \(b\) and \(c\), which are not a solution of the system.
</li>
</ol>

<p>
Assignment \(a = 1\), \(b = 1\) and \(c = 1\) gives no solutions.
</p>

<div class="org-src-container">

<pre class="src src-maxima" id="sys5"><span style="color: #f0ffff; background-color: #0d1719;">programmode:</span> <span style="color: #dd9aa7; background-color: #0a1519;">false</span>;
solution<span style="color: #f0ffff; background-color: #0d1719;">:</span> <span style="color: #75dbb7; background-color: #0a1519;">triangularize</span>(<span style="color: #75dbb7; background-color: #0a1519;">coefmatrix</span>(
[ <span style="color: #f0ffff; background-color: #0d1719;">-</span><span style="color: #dd9aa7; background-color: #0a1519;">3</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">11</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>y <span style="color: #f0ffff; background-color: #0d1719;">+</span> <span style="color: #dd9aa7; background-color: #0a1519;">7</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">=</span> a,
   <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>x <span style="color: #f0ffff; background-color: #0d1719;">+</span>  <span style="color: #dd9aa7; background-color: #0a1519;">6</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>y <span style="color: #f0ffff; background-color: #0d1719;">-</span> <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>z <span style="color: #f0ffff; background-color: #0d1719;">=</span> b,
     x <span style="color: #f0ffff; background-color: #0d1719;">+</span>  <span style="color: #dd9aa7; background-color: #0a1519;">2</span><span style="color: #f0ffff; background-color: #0d1719;">*</span>y <span style="color: #f0ffff; background-color: #0d1719;">+</span>   z <span style="color: #f0ffff; background-color: #0d1719;">=</span> c],
     [x, y, z]));
<span style="color: #75dbb7; background-color: #0a1519;">print</span>(solution);
</pre>
</div>

<pre class="example">
[ - 3  - 11   7  ]
[                ]
[  0    4    - 8 ] 
[                ]
[  0    0     0  ]
</pre>

<p>
Triangulated matrix of the above solution doesn't have pivot in the third
column, thus it doesn't have a unique solution.
</p>

<p>
<i>Answer:</i> <b>b</b>
</p>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Exercise 4</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li>If \(O\) has infinitely many solutions, then \(n \geq m\).
</li>
<li>If \(n > m\), then \(M\) has infinitely many solutions.
</li>
</ol>

<p>
(1) Not necessarily so because it is possible to have dependent equations.
We could simply repeat the same euqation \(n+1\) times to find a counterexample.
</p>

<p>
(2) Not necessarily so because it is possible to have such matrices, which don't
have solutions at all.
</p>

<p>
<i>Answer:</i> <b>d</b>
</p>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Exercise 5</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>If \(\vec{c}\), \(\vec{d}\) are solutions of \(M\), and \(\mu \vec{d}\), 
      \(\lambda \vec{c}\) are solutions of \(M\) then \(\lambda + \mu = 1\).
</li>
<li>If \(\vec{c}\) is a solution of \(M\) and \(\vec{d}\) is a solution of \(O\), then
      \(\vec{c} - 3\vec{d}\) is a solution of \(M\).
</li>
</ol>

<p>
(1) Would be true, if \(\vec{d}\) and \(\vec{c}\) were the same vector and \(M\) had only
one solution thus.  But if \(\vec{c}\) and \(\vec{d}\) are distinct, this warrants
infinitely many solutions, thus there is no requirement that a scalar multiplier
of the elementary operations performed on the solution be any particular value.
</p>

<p>
(2) If \(\vec{c}\) is a unique solution of \(M\), then \(O\) has a unique solution too.
Since a solution of homogenous matrix is a zero vector, then adding any multiple
of it won't change the value of \(\vec{c}\).  But if \(M\) has infinitely many
solutions, then it is possible to see \(\vec{c} - 3\vec{d}\) as bein an elementary
operation, which we can accomodate in place of at least one free unknown, which
has to be present in this case.
</p>

<p>
<i>Answer:</i> <b>b</b>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2014-10-31 Fri&gt;</span></span></p>
<p class="author">Author: Oleg Sivokon</p>
<p class="date">Created: 2014-11-02 Sun 23:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.0.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.2)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
