assignment-11.tex
\subsection{Exercise 3}
\label{sec-2-3}

\begin{maxima}
programmode: false;
linsystem: [  x + 2*y -  3*z = a,
            2*x + 6*y - 11*z = b,
              x - 2*y +  7*z = c];
linsolve(linsystem, [a, b, c]);
\end{maxima}

\begin{verbatim}
Solution:
                              a = - 3 z + 2 y + x
                            b = - 11 z + 6 y + 2 x
                               c = 7 z - 2 y + x
\end{verbatim}


\begin{enumerate}
\item There exist such $a$, $b$ and $c$, which are the unique solution to
the system.
\item There are such $a$, $b$ and $c$, which are not a solution of the system.
\end{enumerate}

Assignment $a = 1$, $b = 1$ and $c = 1$ gives no solutions.

\begin{maxima}
programmode: false;
solution: triangularize(coefmatrix(
[ -3*x - 11*y + 7*z = a,
   2*x +  6*y - 2*z = b,
     x +  2*y +   z = c],
     [x, y, z]));
print(solution);
\end{maxima}

\begin{verbatim}
[ - 3  - 11   7  ]
[                ]
[  0    4    - 8 ] 
[                ]
[  0    0     0  ]
\end{verbatim}

Triangulated matrix of the above solution doesn't have pivot in the third
column, thus it doesn't have a unique solution.

\emph{Answer:} \textbf{b}
\subsection{Exercise 4}
\label{sec-2-4}
\begin{enumerate}
\item If $O$ has infinitely many solutions, then $n \geq m$.
\item If $n > m$, then $M$ has infinitely many solutions.
\end{enumerate}

(1) Not necessarily so because it is possible to have dependent equations.
We could simply repeat the same euqation $n+1$ times to find a counterexample.

(2) Not necessarily so because it is possible to have such matrices, which don't
have solutions at all.

\emph{Answer:} \textbf{d}
\subsection{Exercise 5}
\label{sec-2-5}
\begin{enumerate}
\item If $\vec{c}$, $\vec{d}$ are solutions of $M$, and $\mu \vec{d}$, 
      $\lambda \vec{c}$ are solutions of $M$ then $\lambda + \mu = 1$.
\item If $\vec{c}$ is a solution of $M$ and $\vec{d}$ is a solution of $O$, then
      $\vec{c} - 3\vec{d}$ is a solution of $M$.
\end{enumerate}

(1) Would be true, if $\vec{d}$ and $\vec{c}$ were the same vector and $M$ had only
one solution thus.  But if $\vec{c}$ and $\vec{d}$ are distinct, this warrants
infinitely many solutions, thus there is no requirement that a scalar multiplier
of the elementary operations performed on the solution be any particular value.

(2) If $\vec{c}$ is a unique solution of $M$, then $O$ has a unique solution too.
Since a solution of homogenous matrix is a zero vector, then adding any multiple
of it won't change the value of $\vec{c}$.  But if $M$ has infinitely many
solutions, then it is possible to see $\vec{c} - 3\vec{d}$ as bein an elementary
operation, which we can accomodate in place of at least one free unknown, which
has to be present in this case.

\emph{Answer:} \textbf{b}
% Emacs 25.0.50.1 (Org mode 8.2.2)
\end{document}